Autodesk.Revit.DB.Structure.RebarBarTypeSet
A set that contains RebarBar types.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.Insert(Autodesk.Revit.DB.Structure.RebarBarType)
System.Int32
Insert the specified RebarBar type into the set.
item: The RebarBar type to be inserted into the set.
Returns: Returns whether the RebarBar type was inserted into the set.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.ReverseIterator
Autodesk.Revit.DB.Structure.RebarBarTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.ForwardIterator
Autodesk.Revit.DB.Structure.RebarBarTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.Erase(Autodesk.Revit.DB.Structure.RebarBarType)
System.Int32
Removes a specified RebarBar type from the set.
item: The RebarBar type to be erased.
Returns: The number of RebarBar types that were erased from the set.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.Contains(Autodesk.Revit.DB.Structure.RebarBarType)
System.Boolean
Tests for the existence of a RebarBar type within the set.
item: The RebarBar type to be searched for.
Returns: The Contains method returns True if the RebarBar type is within the set, otherwise False.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.Clear
void
Removes every RebarBar type from the set, rendering it empty.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.Size
System.Int32
get
Returns the number of RebarBar types that are in the set.

Autodesk.Revit.DB.Structure.RebarBarTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.